qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3XX/stm32f30x_hrtim.c
  /* Disable the timer output */
  HRTIMx->HRTIM_COMMON.DISR |= PWMChannel;
    
  /* Disable the timer counter */
   __HRTIM_DISABLE(HRTIMx, TimerIdxToTimerId[TimerIdx]);
}

/**
  * @brief  Enables a basic capture on the designed capture unit
  * @param  HRTIMx: pointer to HRTIM peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  CaptureChannel: Timer output
  *                    This parameter can be one of the following values: 
  *                    @arg HRTIM_CAPTUREUNIT_1: Capture unit 1
  *                    @arg HRTIM_CAPTUREUNIT_2: Capture unit 2
  * @retval None
  * @note  The external event triggering the capture is available for all timing 
  *        units. It can be used directly and is active as soon as the timing 
  *        unit counter is enabled.
  */
void HRTIM_SimpleCaptureStart(HRTIM_TypeDef * HRTIMx,
                                              uint32_t TimerIdx,
                                              uint32_t CaptureChannel)
{
  /* Enable the timer counter */
  __HRTIM_ENABLE(HRTIMx, TimerIdxToTimerId[TimerIdx]);

}

/**
  * @brief  Disables a basic capture on the designed capture unit 
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  CaptureChannel: Timer output
  *                    This parameter can be one of the following values: 
  *                    @arg HRTIM_CAPTUREUNIT_1: Capture unit 1
  *                    @arg HRTIM_CAPTUREUNIT_2: Capture unit 2
  * @retval None
  */
void HRTIM_SimpleCaptureStop(HRTIM_TypeDef * HRTIMx,
                                             uint32_t TimerIdx,
                                             uint32_t CaptureChannel)
{
   /* Check the parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));
  assert_param(IS_HRTIM_CAPTUREUNIT(CaptureChannel));
    
  /* Set the capture unit trigger */
  switch (CaptureChannel)
  {
    case HRTIM_CAPTUREUNIT_1:
    {
      HRTIMx->HRTIM_TIMERx[TimerIdx].CPT1xCR = HRTIM_CAPTURETRIGGER_NONE;
    }
    break;
    case HRTIM_CAPTUREUNIT_2:
    {
      HRTIMx->HRTIM_TIMERx[TimerIdx].CPT2xCR = HRTIM_CAPTURETRIGGER_NONE;
    }
    break;
    default:
    break;  
  }
  
  /* Disable the timer counter */
  if ((HRTIMx->HRTIM_TIMERx[TimerIdx].CPT1xCR == HRTIM_CAPTURETRIGGER_NONE) &&
      (HRTIMx->HRTIM_TIMERx[TimerIdx].CPT2xCR == HRTIM_CAPTURETRIGGER_NONE))
  {
    __HRTIM_DISABLE(HRTIMx, TimerIdxToTimerId[TimerIdx]);
  }
  
}

/**
  * @brief  Enables the basic one pulse signal generation on the designed output 
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  OnePulseChannel: Timer output
  *                    This parameter can be one of the following values:
  *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
  *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
  *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
  *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
  *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
  *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
  *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
  *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
  *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
  *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
  * @retval None
  */
void HRTIM_SimpleOnePulseStart(HRTIM_TypeDef * HRTIMx,
                                                uint32_t TimerIdx,
                                                uint32_t OnePulseChannel)
{
   /* Check the parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OnePulseChannel));
  
  /* Enable the timer output */
  HRTIMx->HRTIM_COMMON.OENR |= OnePulseChannel;
    
  /* Enable the timer counter */
  __HRTIM_ENABLE(HRTIMx, TimerIdxToTimerId[TimerIdx]);
}

/**
  * @brief  Disables the basic one pulse signal generation on the designed output 
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  OnePulseChannel: Timer output
  *                    This parameter can be one of the following values:
  *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
  *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
  *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
  *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
  *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
  *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
  *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
  *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
  *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
  *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
  * @retval None
  */
void HRTIM_SimpleOnePulseStop(HRTIM_TypeDef * HRTIMx,
                                              uint32_t TimerIdx,
                                              uint32_t OnePulseChannel)
{
   /* Check the parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OnePulseChannel));
   
  /* Disable the timer output */
  HRTIMx->HRTIM_COMMON.DISR |= OnePulseChannel;
  
  /* Disable the timer counter */
  __HRTIM_DISABLE(HRTIMx, TimerIdxToTimerId[TimerIdx]);
}

/**
  * @brief  Starts the counter of the designated timer(s) operating in waveform mode
  *         Timers can be combined (ORed) to allow for simultaneous counter start
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimersToStart: Timer counter(s) to start
  *                   This parameter can be any combination of the following values:
  *                   @arg HRTIM_TIMERID_MASTER 
  *                   @arg HRTIM_TIMERID_TIMER_A 
  *                   @arg HRTIM_TIMERID_TIMER_B 
  *                   @arg HRTIM_TIMERID_TIMER_C 
  *                   @arg HRTIM_TIMERID_TIMER_D 
  *                   @arg HRTIM_TIMERID_TIMER_E 
  * @retval None
  */
void HRTIM_WaveformCounterStart(HRTIM_TypeDef * HRTIMx,
                                                 uint32_t TimersToStart)
{ 
   /* Enable timer(s) counter */
   HRTIMx->HRTIM_MASTER.MCR |= TimersToStart;
}

/**
  * @brief  Stops the counter of the designated timer(s) operating in waveform mode
  *         Timers can be combined (ORed) to allow for simultaneous counter stop
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimersToStop: Timer counter(s) to stop
  *                   This parameter can be any combination of the following values:
  *                   @arg HRTIM_TIMER_MASTER 
  *                   @arg HRTIM_TIMER_A 
  *                   @arg HRTIM_TIMER_B 
  *                   @arg HRTIM_TIMER_C 
  *                   @arg HRTIM_TIMER_D 
  *                   @arg HRTIM_TIMER_E 
  * @retval None
  */
void HRTIM_WaveformCounterStop(HRTIM_TypeDef * HRTIMx,
                                                uint32_t TimersToStop)
{
  /* Disable timer(s) counter */
  HRTIMx->HRTIM_MASTER.MCR &= ~TimersToStop;
}

/**
  * @brief  Enables the generation of the waveform signal on the designated output(s)
  *         Outputs can be combined (ORed) to allow for simultaneous output enabling
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  OutputsToStart: Timer output(s) to enable
  *                    This parameter can be any combination of the following values:
  *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
  *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
  *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
  *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
  *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
  *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
  *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
  *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
  *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
  *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
  * @retval None
  */
void HRTIM_WaveformOutputStart(HRTIM_TypeDef * HRTIMx,
                                                uint32_t OutputsToStart)
{
  /* Enable the HRTIM outputs */
  HRTIMx->HRTIM_COMMON.OENR = OutputsToStart;
}

/**
  * @brief  Disables the generation of the waveform signal on the designated output(s)
  *         Outputs can be combined (ORed) to allow for simultaneous output disabling
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  OutputsToStop: Timer output(s) to disable
  *                    This parameter can be any combination of the following values:
  *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
  *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
  *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
  *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
  *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
  *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
  *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
  *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
  *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
  *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
  * @retval None
  */
void HRTIM_WaveformOutputStop(HRTIM_TypeDef * HRTIMx,
                                               uint32_t OutputsToStop)
{
  /* Disable the HRTIM outputs */
  HRTIMx->HRTIM_COMMON.DISR = OutputsToStop;
}

/**
  * @brief  Enables or disables the Master and slaves interrupt request
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  HRTIM_IT: specifies the HRTIM interrupts sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_MASTER_IT_MCMP1: Master compare 1 interrupt source
  *            @arg HRTIM_MASTER_IT_MCMP2: Master compare 2 interrupt source
  *            @arg HRTIM_MASTER_IT_MCMP3: Master compare 3 interrupt Interrupt source
  *            @arg HRTIM_MASTER_IT_MCMP4: Master compare 4 Interrupt source
  *            @arg HRTIM_MASTER_IT_MREP: Master Repetition Interrupt source
  *            @arg HRTIM_MASTER_IT_SYNC: Synchronization input Interrupt source
  *            @arg HRTIM_MASTER_IT_MUPD: Master update Interrupt source
  *            @arg HRTIM_TIM_IT_CMP1: Timer compare 1 Interrupt source
  *            @arg HRTIM_TIM_IT_CMP2: Timer compare 2 Interrupt source
  *            @arg HRTIM_TIM_IT_CMP3: Timer compare 3 Interrupt source
  *            @arg HRTIM_TIM_IT_CMP4: Timer compare 4 Interrupt source
  *            @arg HRTIM_TIM_IT_REP: Timer repetition Interrupt source
  *            @arg HRTIM_TIM_IT_UPD: Timer update Interrupt source
  *            @arg HRTIM_TIM_IT_CPT1: Timer capture 1 Interrupt source
  *            @arg HRTIM_TIM_IT_CPT2: Timer capture 2 Interrupt source
  *            @arg HRTIM_TIM_IT_SET1: Timer output 1 set Interrupt source
  *            @arg HRTIM_TIM_IT_RST1: Timer output 1 reset Interrupt source
  *            @arg HRTIM_TIM_IT_SET2: Timer output 2 set Interrupt source
  *            @arg HRTIM_TIM_IT_RST2: Timer output 2 reset Interrupt source
  *            @arg HRTIM_TIM_IT_RST: Timer reset Interrupt source
  *            @arg HRTIM_TIM_IT_DLYPRT1: Timer delay protection Interrupt source
  * @param  NewState: new state of the TIM interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void HRTIM_ITConfig(HRTIM_TypeDef * HRTIMx, uint32_t TimerIdx, uint32_t HRTIM_IT, FunctionalState NewState)
{
  if(TimerIdx != HRTIM_TIMERINDEX_MASTER)
  {  
    if(NewState != DISABLE)
    {
      HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxDIER |= HRTIM_IT;
    }
    else
    {
      HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxDIER &= ~HRTIM_IT;
    }
  }
  else  
  {
    if(NewState != DISABLE)
    {
      HRTIMx->HRTIM_MASTER.MDIER |= HRTIM_IT;
    }
    else
    {
      HRTIMx->HRTIM_MASTER.MDIER &= ~HRTIM_IT;
    }  
  }
}

/**
  * @brief  Enables or disables the common interrupt request
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  HRTIM_IT: specifies the HRTIM interrupts sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_IT_FLT1: Fault 1 interrupt source
  *            @arg HRTIM_IT_FLT2: Fault 2 interrupt source
  *            @arg HRTIM_IT_FLT3: Fault 3 interrupt Interrupt source
  *            @arg HRTIM_IT_FLT4: Fault 4 Interrupt source
  *            @arg HRTIM_IT_FLT5: Fault 5  Interrupt source
  *            @arg HRTIM_IT_SYSFLT: System Fault Interrupt source
  *            @arg HRTIM_IT_DLLRDY: DLL ready Interrupt source
  *            @arg HRTIM_IT_BMPER: Burst mode period Interrupt source
  * @param  NewState: new state of the TIM interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void HRTIM_ITCommonConfig(HRTIM_TypeDef * HRTIMx, uint32_t HRTIM_CommonIT, FunctionalState NewState)
{
   if(NewState != DISABLE)
    {
      HRTIMx->HRTIM_COMMON.IER |= HRTIM_CommonIT;
    }
    else
    {
      HRTIMx->HRTIM_COMMON.IER &= ~HRTIM_CommonIT;
    }
}

/**
  * @brief  Clears the Master and slaves interrupt flags
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  HRTIM_FLAG: specifies the HRTIM flags sources to be cleared.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_MASTER_FLAG_MCMP1: Master compare 1 interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MCMP2: Master compare 2 interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MCMP3: Master compare 3 interrupt Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MCMP4: Master compare 4 Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MREP: Master Repetition Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_SYNC: Synchronization input Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MUPD: Master update Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP1: Timer compare 1 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP2: Timer compare 2 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP3: Timer compare 3 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP4: Timer compare 4 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_REP: Timer repetition Interrupt flag
  *            @arg HRTIM_TIM_FLAG_UPD: Timer update Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CPT1: Timer capture 1 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CPT2: Timer capture 2 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_SET1: Timer output 1 set Interrupt flag
  *            @arg HRTIM_TIM_FLAG_RST1: Timer output 1 reset Interrupt flag
  *            @arg HRTIM_TIM_FLAG_SET2: Timer output 2 set Interrupt flag
  *            @arg HRTIM_TIM_FLAG_RST2: Timer output 2 reset Interrupt flag
  *            @arg HRTIM_TIM_FLAG_RST: Timer reset Interrupt flag
  *            @arg HRTIM_TIM_FLAG_DLYPRT1: Timer delay protection Interrupt flag
  * @retval None
  */
void HRTIM_ClearFlag(HRTIM_TypeDef * HRTIMx, uint32_t TimerIdx, uint32_t HRTIM_FLAG)
{
  if(TimerIdx != HRTIM_TIMERINDEX_MASTER)
  {
    HRTIMx->HRTIM_MASTER.MICR |= HRTIM_FLAG;
  }
  else
  {
     HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxICR |= HRTIM_FLAG;
  }  
}

/**
  * @brief  Clears the common interrupt flags
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  HRTIM_FLAG: specifies the HRTIM flags to be cleared.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_FLAG_FLT1: Fault 1 interrupt flag
  *            @arg HRTIM_FLAG_FLT2: Fault 2 interrupt flag
  *            @arg HRTIM_FLAG_FLT3: Fault 3 interrupt Interrupt flag
  *            @arg HRTIM_FLAG_FLT4: Fault 4 Interrupt flag
  *            @arg HRTIM_FLAG_FLT5: Fault 5  Interrupt flag
  *            @arg HRTIM_FLAG_SYSFLT: System Fault Interrupt flag
  *            @arg HRTIM_FLAG_DLLRDY: DLL ready Interrupt flag
  *            @arg HRTIM_FLAG_BMPER: Burst mode period Interrupt flag
  * @retval None
  */
void HRTIM_ClearCommonFlag(HRTIM_TypeDef * HRTIMx, uint32_t HRTIM_CommonFLAG)
{
  HRTIMx->HRTIM_COMMON.ICR |= HRTIM_CommonFLAG;
}

/**
  * @brief  Clears the Master and slaves interrupt request pending bits
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  HRTIM_IT: specifies the HRTIM interrupts sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_MASTER_IT_MCMP1: Master compare 1 interrupt source
  *            @arg HRTIM_MASTER_IT_MCMP2: Master compare 2 interrupt source
  *            @arg HRTIM_MASTER_IT_MCMP3: Master compare 3 interrupt Interrupt source
  *            @arg HRTIM_MASTER_IT_MCMP4: Master compare 4 Interrupt source
  *            @arg HRTIM_MASTER_IT_MREP: Master Repetition Interrupt source
  *            @arg HRTIM_MASTER_IT_SYNC: Synchronization input Interrupt source
  *            @arg HRTIM_MASTER_IT_MUPD: Master update Interrupt source
  *            @arg HRTIM_TIM_IT_CMP1: Timer compare 1 Interrupt source
  *            @arg HRTIM_TIM_IT_CMP2: Timer compare 2 Interrupt source
  *            @arg HRTIM_TIM_IT_CMP3: Timer compare 3 Interrupt source
  *            @arg HRTIM_TIM_IT_CMP4: Timer compare 4 Interrupt source
  *            @arg HRTIM_TIM_IT_REP: Timer repetition Interrupt source
  *            @arg HRTIM_TIM_IT_UPD: Timer update Interrupt source
  *            @arg HRTIM_TIM_IT_CPT1: Timer capture 1 Interrupt source
  *            @arg HRTIM_TIM_IT_CPT2: Timer capture 2 Interrupt source
  *            @arg HRTIM_TIM_IT_SET1: Timer output 1 set Interrupt source
  *            @arg HRTIM_TIM_IT_RST1: Timer output 1 reset Interrupt source
  *            @arg HRTIM_TIM_IT_SET2: Timer output 2 set Interrupt source
  *            @arg HRTIM_TIM_IT_RST2: Timer output 2 reset Interrupt source
  *            @arg HRTIM_TIM_IT_RST: Timer reset Interrupt source
  *            @arg HRTIM_TIM_IT_DLYPRT: Timer delay protection Interrupt source
  * @retval None
  */
void HRTIM_ClearITPendingBit(HRTIM_TypeDef * HRTIMx, uint32_t TimerIdx, uint32_t HRTIM_IT)
{
  if(TimerIdx != HRTIM_TIMERINDEX_MASTER)
  {
    HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxICR |= HRTIM_IT;
  }
  else 
  {   
    HRTIMx->HRTIM_MASTER.MICR |= HRTIM_IT;
  }
}

/**
  * @brief  Clears the common interrupt pending bits
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  HRTIM_IT: specifies the HRTIM interrupts sources to be cleared.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_IT_FLT1: Fault 1 interrupt source
  *            @arg HRTIM_IT_FLT2: Fault 2 interrupt source
  *            @arg HRTIM_IT_FLT3: Fault 3 interrupt Interrupt source
  *            @arg HRTIM_IT_FLT4: Fault 4 Interrupt source
  *            @arg HRTIM_IT_FLT5: Fault 5  Interrupt source
  *            @arg HRTIM_IT_SYSFLT: System Fault Interrupt source
  *            @arg HRTIM_IT_DLLRDY: DLL ready Interrupt source
  *            @arg HRTIM_IT_BMPER: Burst mode period Interrupt source
  * @retval None
  */
void HRTIM_ClearCommonITPendingBit(HRTIM_TypeDef * HRTIMx, uint32_t HRTIM_CommonIT)
{
  HRTIMx->HRTIM_COMMON.ICR |= HRTIM_CommonIT;
}


/**
  * @brief  Checks whether the specified HRTIM flag is set or not.
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  HRTIM_FLAG: specifies the HRTIM flags to check.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_MASTER_FLAG_MCMP1: Master compare 1 interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MCMP2: Master compare 2 interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MCMP3: Master compare 3 interrupt Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MCMP4: Master compare 4 Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MREP: Master Repetition Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_SYNC: Synchronization input Interrupt flag
  *            @arg HRTIM_MASTER_FLAG_MUPD: Master update Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP1: Timer compare 1 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP2: Timer compare 2 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP3: Timer compare 3 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CMP4: Timer compare 4 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_REP: Timer repetition Interrupt flag
  *            @arg HRTIM_TIM_FLAG_UPD: Timer update Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CPT1: Timer capture 1 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_CPT2: Timer capture 2 Interrupt flag
  *            @arg HRTIM_TIM_FLAG_SET1: Timer output 1 set Interrupt flag
  *            @arg HRTIM_TIM_FLAG_RST1: Timer output 1 reset Interrupt flag
  *            @arg HRTIM_TIM_FLAG_SET2: Timer output 2 set Interrupt flag
  *            @arg HRTIM_TIM_FLAG_RST2: Timer output 2 reset Interrupt flag
  *            @arg HRTIM_TIM_FLAG_RST: Timer reset Interrupt flag
  *            @arg HRTIM_TIM_FLAG_DLYPRT: Timer delay protection Interrupt flag
  * @retval The new state of HRTIM_FLAG (SET or RESET).
  */
FlagStatus HRTIM_GetFlagStatus(HRTIM_TypeDef * HRTIMx, uint32_t TimerIdx, uint32_t HRTIM_FLAG)
{
  FlagStatus bitstatus = RESET;  

  if(TimerIdx != HRTIM_TIMERINDEX_MASTER)
  {  
    if ((HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxISR & HRTIM_FLAG) != RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
    if ((HRTIMx->HRTIM_MASTER.MISR & HRTIM_FLAG) != RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }  
  return bitstatus;
}

/**
  * @brief  Checks whether the specified HRTIM common flag is set or not.
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  HRTIM_FLAG: specifies the HRTIM flags to check.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_FLAG_FLT1: Fault 1 interrupt flag
  *            @arg HRTIM_FLAG_FLT2: Fault 2 interrupt flag
  *            @arg HRTIM_FLAG_FLT3: Fault 3 interrupt Interrupt flag
  *            @arg HRTIM_FLAG_FLT4: Fault 4 Interrupt flag
  *            @arg HRTIM_FLAG_FLT5: Fault 5  Interrupt flag
  *            @arg HRTIM_FLAG_SYSFLT: System Fault Interrupt flag
  *            @arg HRTIM_FLAG_DLLRDY: DLL ready Interrupt flag
  *            @arg HRTIM_FLAG_BMPER: Burst mode period Interrupt flag
  * @retval The new state of HRTIM_FLAG (SET or RESET).
  */
FlagStatus HRTIM_GetCommonFlagStatus(HRTIM_TypeDef * HRTIMx, uint32_t HRTIM_CommonFLAG)
{
  FlagStatus bitstatus = RESET;  

