qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3XX/stm32f30x_hrtim.c
  if((HRTIMx->HRTIM_COMMON.ISR & HRTIM_CommonFLAG) != RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  return bitstatus;
}
                                       
/**
  * @brief  Checks whether the specified HRTIM interrupt has occurred or not.
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  HRTIM_IT: specifies the HRTIM flags sources to be cleared.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_MASTER_IT_MCMP1: Master compare 1 interrupt 
  *            @arg HRTIM_MASTER_IT_MCMP2: Master compare 2 interrupt 
  *            @arg HRTIM_MASTER_IT_MCMP3: Master compare 3 interrupt Interrupt 
  *            @arg HRTIM_MASTER_IT_MCMP4: Master compare 4 Interrupt 
  *            @arg HRTIM_MASTER_IT_MREP: Master Repetition Interrupt 
  *            @arg HRTIM_MASTER_IT_SYNC: Synchronization input Interrupt 
  *            @arg HRTIM_MASTER_IT_MUPD: Master update Interrupt 
  *            @arg HRTIM_TIM_IT_CMP1: Timer compare 1 Interrupt 
  *            @arg HRTIM_TIM_IT_CMP2: Timer compare 2 Interrupt 
  *            @arg HRTIM_TIM_IT_CMP3: Timer compare 3 Interrupt 
  *            @arg HRTIM_TIM_IT_CMP4: Timer compare 4 Interrupt 
  *            @arg HRTIM_TIM_IT_REP: Timer repetition Interrupt 
  *            @arg HRTIM_TIM_IT_UPD: Timer update Interrupt 
  *            @arg HRTIM_TIM_IT_CPT1: Timer capture 1 Interrupt 
  *            @arg HRTIM_TIM_IT_CPT2: Timer capture 2 Interrupt 
  *            @arg HRTIM_TIM_IT_SET1: Timer output 1 set Interrupt 
  *            @arg HRTIM_TIM_IT_RST1: Timer output 1 reset Interrupt 
  *            @arg HRTIM_TIM_IT_SET2: Timer output 2 set Interrupt 
  *            @arg HRTIM_TIM_IT_RST2: Timer output 2 reset Interrupt 
  *            @arg HRTIM_TIM_IT_RST: Timer reset Interrupt 
  *            @arg HRTIM_TIM_IT_DLYPRT: Timer delay protection Interrupt 
  * @retval The new state of the HRTIM_IT(SET or RESET).
  */
ITStatus HRTIM_GetITStatus(HRTIM_TypeDef * HRTIMx, uint32_t TimerIdx, uint32_t HRTIM_IT)
{
  ITStatus bitstatus = RESET;  
  uint16_t itstatus = 0x0, itenable = 0x0;

  if(TimerIdx != HRTIM_TIMERINDEX_MASTER)
  {  
    itstatus = HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxISR & HRTIM_IT;
  
    itenable = HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxDIER & HRTIM_IT;
    if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
    itstatus = HRTIMx->HRTIM_MASTER.MISR & HRTIM_IT;
  
    itenable = HRTIMx->HRTIM_MASTER.MDIER & HRTIM_IT;
    if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }  
  return bitstatus;
}

/**
  * @brief  Checks whether the specified HRTIM common interrupt has occurred or not.
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  HRTIM_IT: specifies the HRTIM interrupt source to check.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_IT_FLT1: Fault 1 interrupt 
  *            @arg HRTIM_IT_FLT2: Fault 2 interrupt 
  *            @arg HRTIM_IT_FLT3: Fault 3 interrupt Interrupt 
  *            @arg HRTIM_IT_FLT4: Fault 4 Interrupt 
  *            @arg HRTIM_IT_FLT5: Fault 5  Interrupt 
  *            @arg HRTIM_IT_SYSFLT: System Fault Interrupt 
  *            @arg HRTIM_IT_DLLRDY: DLL ready Interrupt flag
  *            @arg HRTIM_IT_BMPER: Burst mode period Interrupt 
  * @retval The new state of HRTIM_FLAG (SET or RESET).
  */
ITStatus HRTIM_GetCommonITStatus(HRTIM_TypeDef * HRTIMx, uint32_t HRTIM_CommonIT)
{
  ITStatus bitstatus = RESET;  
  uint16_t itstatus = 0x0, itenable = 0x0;
 
  itstatus = HRTIMx->HRTIM_COMMON.ISR & HRTIM_CommonIT; 
  itenable = HRTIMx->HRTIM_COMMON.IER & HRTIM_CommonIT;
  
  if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/**
  * @brief  Enables or disables the HRTIMx's DMA Requests.
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  HRTIM_DMA: specifies the DMA Request sources.
  *          This parameter can be any combination of the following values:
  *            @arg HRTIM_MASTER_DMA_MCMP1: Master compare 1 DMA request source
  *            @arg HRTIM_MASTER_DMA_MCMP2: Master compare 2 DMA request source
  *            @arg HRTIM_MASTER_DMA_MCMP3: Master compare 3 DMA request source
  *            @arg HRTIM_MASTER_DMA_MCMP4: Master compare 4 DMA request source
  *            @arg HRTIM_MASTER_DMA_MREP: Master Repetition DMA request source
  *            @arg HRTIM_MASTER_DMA_SYNC: Synchronization input DMA request source
  *            @arg HRTIM_MASTER_DMA_MUPD:Master update DMA request source
  *            @arg HRTIM_TIM_DMA_CMP1: Timer compare 1 DMA request source 
  *            @arg HRTIM_TIM_DMA_CMP2: Timer compare 2 DMA request source 
  *            @arg HRTIM_TIM_DMA_CMP3: Timer compare 3 DMA request source 
  *            @arg HRTIM_TIM_DMA_CMP4: Timer compare 4 DMA request source 
  *            @arg HRTIM_TIM_DMA_REP: Timer repetition DMA request source 
  *            @arg HRTIM_TIM_DMA_UPD: Timer update DMA request source 
  *            @arg HRTIM_TIM_DMA_CPT1: Timer capture 1 DMA request source 
  *            @arg HRTIM_TIM_DMA_CPT2: Timer capture 2 DMA request source 
  *            @arg HRTIM_TIM_DMA_SET1: Timer output 1 set DMA request source 
  *            @arg HRTIM_TIM_DMA_RST1: Timer output 1 reset DMA request source 
  *            @arg HRTIM_TIM_DMA_SET2: Timer output 2 set DMA request source 
  *            @arg HRTIM_TIM_DMA_RST2: Timer output 2 reset DMA request source 
  *            @arg HRTIM_TIM_DMA_RST: Timer reset DMA request source 
  *            @arg HRTIM_TIM_DMA_DLYPRT: Timer delay protection DMA request source 
  * @param  NewState: new state of the DMA Request sources.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void HRTIM_DMACmd(HRTIM_TypeDef* HRTIMx, uint32_t TimerIdx, uint32_t HRTIM_DMA, FunctionalState NewState)
{
  if(TimerIdx != HRTIM_TIMERINDEX_MASTER)
  { 
     if(NewState != DISABLE)
     {
       HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxDIER |= HRTIM_DMA;
     }
     else
     {
       HRTIMx->HRTIM_TIMERx[TimerIdx].TIMxDIER &= ~HRTIM_DMA;
     }
  }
  else
  {
     if(NewState != DISABLE)
     {
       HRTIMx->HRTIM_MASTER.MDIER |= HRTIM_DMA;
     }
     else
     {
       HRTIMx->HRTIM_MASTER.MDIER &= ~HRTIM_DMA;
     }
  }  
}

/**
  * @}
  */

/** @defgroup HRTIM_Group3 Peripheral Control methods 
 *  @brief   management functions 
 *
@verbatim   
 ===============================================================================
                      ##### Peripheral Control methods #####
 ===============================================================================  
    [..]
    This subsection provides a set of functions allowing to control the HRTIMx data 
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Configures an output in basic output compare mode 
  * @param  HRTIMx: pointer to HRTIMx peripheral
  * @param  TimerIdx: Timer index
  *                   This parameter can be one of the following values:
  *                   @arg 0x0 to 0x4 for timers A to E 
  * @param  OCChannel: Timer output
  *                    This parameter can be one of the following values:
  *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
  *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
  *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
  *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
  *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
  *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
  *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
  *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
  *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
  *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2 
  * @param  pBasicOCChannelCfg: pointer to the basic output compare output configuration structure
  * @note When the timer operates in basic output compare mode:
  *         Output 1 is implicitely controled by the compare unit 1
  *         Output 2 is implicitely controled by the compare unit 2
  *       Output Set/Reset crossbar is set according to the selected output compare mode:
  *         Toggle: SETxyR = RSTxyR = CMPy
  *         Active: SETxyR = CMPy, RSTxyR = 0
  *         Inactive: SETxy =0, RSTxy = CMPy
  * @retval None
  */
void HRTIM_SimpleOCChannelConfig(HRTIM_TypeDef * HRTIM_,
                                                 uint32_t TimerIdx,
                                                 uint32_t OCChannel,
                                                 HRTIM_BasicOCChannelCfgTypeDef* pBasicOCChannelCfg)
{
  uint32_t CompareUnit = HRTIM_COMPAREUNIT_1;
  HRTIM_CompareCfgTypeDef CompareCfg;
  HRTIM_OutputCfgTypeDef OutputCfg;
  
  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OCChannel));
  assert_param(IS_HRTIM_BASICOCMODE(pBasicOCChannelCfg->Mode));
  assert_param(IS_HRTIM_OUTPUTPOLARITY(pBasicOCChannelCfg->Polarity));
  assert_param(IS_HRTIM_OUTPUTIDLESTATE(pBasicOCChannelCfg->IdleState));
    
  /* Configure timer compare unit */  
  switch (OCChannel)
  {
    case HRTIM_OUTPUT_TA1:
    case HRTIM_OUTPUT_TB1:
    case HRTIM_OUTPUT_TC1:
    case HRTIM_OUTPUT_TD1:
    case HRTIM_OUTPUT_TE1:
    {
      CompareUnit = HRTIM_COMPAREUNIT_1;
    }
    break;
    case HRTIM_OUTPUT_TA2:
    case HRTIM_OUTPUT_TB2:
    case HRTIM_OUTPUT_TC2:
    case HRTIM_OUTPUT_TD2:
    case HRTIM_OUTPUT_TE2:
    {
      CompareUnit = HRTIM_COMPAREUNIT_2;
    }
    break;
    default:
    break;
  }
  
  CompareCfg.CompareValue = pBasicOCChannelCfg->Pulse;
  CompareCfg.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
  CompareCfg.AutoDelayedTimeout = 0;
  
